BreweryCRM/Documents/Соглашения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Соглашения</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоглашениеПодписано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

BreweryCRM/InformationRegisters/ИсторияВзаимодействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИсторияВзаимодействий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипВзаимодействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВзаимодействий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

BreweryCRM/Enums/ТипыВзаимодействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыВзаимодействий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОформлениеДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодписаниеСоглашения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеЗаказа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BreweryCRM/Documents/Соглашения/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Файлы(Команда)    
	Клиент = Объект.Клиент;
	Форма = ПолучитьФорму("Справочник.ФайлыКлиентов.Форма.ФормаЭлемента");    
	Форма.Объект.Владелец = Клиент;
	Форма.Открыть();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Объект.Дата = ТекущаяДата();
	История = РегистрыСведений.ИсторияВзаимодействий.СоздатьНаборЗаписей(); 
	История.Прочитать();
	ЗаписьИстории = История.Добавить();
	ЗаписьИстории.ТипВзаимодействия = Перечисления.ТипыВзаимодействий.ПодписаниеСоглашения; 
	ЗаписьИстории.Клиент = Объект.Клиент;
	ЗаписьИстории.Период = Объект.Дата;
	История.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)     
	Договор = Объект.Договор;
	Объект.Клиент = ПолучитьИнформацию(Договор) 
КонецПроцедуры      

Функция ПолучитьИнформацию(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Договора.Клиент КАК Клиент
	|ИЗ
	|	Документ.Договора КАК Договора
	|ГДЕ
	|	Договора.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Клиент;
	КонецЦикла;

КонецФункции
